<?php defined('CORENINPAGE') or die('Hack!');
//todo: сделать разные режимы редиректа, от запроса редиректа в xml-data для xslt, до заголовков http.
//todo: причем как-то это придумать чтобы можно было выбирать модулям, а срабатывало одно.

//todo: сделать специаьлный метод редиректа для прямого вызова, чтобы без событий тоже можно было.

####################################################################################################
####################################################################################################
####################################################################################################
#
class http_redirect_0 extends coren_module
{
#
####################################################################################################
####################################################################################################
####################################################################################################
#
protected $url;
#
####################################################################################################
#
function __construct ($configs)
{
	parent::__construct($configs);

	coren::handler('on_redirect', null, null, null, 'redirect');
	coren::handler('on_shutdown', ''  , ''  , ''  , 'shutdown');
}
#
####################################################################################################
####################################################################################################
####################################################################################################
#
public function on_redirect ($data)
{
	$delay = isset($data['data']['delay']) && is_numeric($data['data']['delay']) ? $data['data']['delay'] : null;
	$url   = isset($data['data']['url'  ]) && is_string ($data['data']['url'  ]) ? $data['data']['url'  ] : null;

	if (is_null($url))
	{
		self::$url = null;
	} else
	{
		$url = (string) $url;
	}
}
#
####################################################################################################
#
public function on_shutdown ($data)
{
	if (headers_sent())
		throw new exception("Can not send redirect header, because headers were sent already.");

	header(sprintf("Location: %s", $this->url));
//???	sprintf('<meta http-equiv="refresh" content="%d;url=%s">', (integer) $delay, htmlspecialchars($url));
}
#
####################################################################################################
####################################################################################################
####################################################################################################
}
?>